pascal-4.0/tutorials/surfaceTracking/newInterTrackFoam/varCapillarity3DoneFluid/system/decomposeParDict.include

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   4;

simpleCoeffs
{
    n                (2 1 2);
    delta            0.001;
}

hierarchicalCoeffs
{
}

metisCoeffs
{
}

scotchCoeffs
{
}

manualCoeffs
{
    dataFile         "cellDecomposition";
}

distributed          no;

roots
(
);

// ************************************************************************* //
